export default {
  'header.links.sign-in': 'Войти',
  'header.links.sign-up': 'Зарегистрироваться',
  'header.button.sign-out': 'Выйти',

  'main.welcome': 'Добро пожаловать, пожалуйста, войдите в систему.',
  'main.signed-in': 'С возвращением, {name}!',
  'main.title': 'REST/GraphiQL клиент',
  'main.links.rest': 'REST Клиент',
  'main.links.graphiql': 'GraphiQL Клиент',
  'main.links.history': 'История',
  'main.links.sign-in': 'Войти',
  'main.links.sign-up': 'Зарегистрироваться',
  'main.project': 'Информация о проекте',
  'main.project-info':
    'Разработанный в качестве итогового задания на курсе React, этот проект демонстрирует скоординированные усилия трёх преданных участников.\nЗавершённое в течение четырёх недель, это приложение является результатом усердной работы и сотрудничества команды.\nПриложение поддерживает как RESTful, так и GraphQL API, включает аутентификацию через Firebase, отслеживание истории запросов и переключение языков.\nПользователи могут настраивать и отправлять запросы, просматривать ответы.',
  'main.team.name-1': 'Иван Жиребный',
  'main.team.role-1': 'Frontend-разработчик, Лидер команды',
  'main.team.contributions-1': 'Настройка среды разработки, Аутентификация, Firebase, GraphQL',
  'main.team.bio-1':
    'Окончил Московский государственный технический университет имени Баумана, завершил программу Frontend-разработчика в HTML Academy.',
  'main.team.name-2': 'Вадим Колымбет',
  'main.team.role-2': 'Frontend-разработчик',
  'main.team.contributions-2': 'Маршрутизация, Интернационализация, Тестирование',
  'main.team.bio-2':
    'Окончил Саратовский государственный университет, обучался на факультете Компьютерных Наук и Информационных Технологий, а также на кафедре Теоретических основ Компьютерной Безопасности и Криптографии. Завершил курсы по верстке от Frontendblok. Работал T-SQL разработчиком.',
  'main.team.name-3': 'Александра Боднар',
  'main.team.role-3': 'Frontend-разработчик, Scrum-мастер',
  'main.team.contributions-3': 'Дизайн, Jira, MUI, REST, Страница истории, Главная страница',
  'main.team.bio-3':
    'Окончила Балтийский федеральный университет имени Иммануила Канта, обучалась на факультете бизнес-информатики. Завершила курсы 3WC по специальности Frontend-разработчик. Разрабатывала функции на PHP для 1C CRM.',
  'main.rs-1':
    'RSSchool — это онлайн-образовательное сообщество, ориентированное на веб-разработку и программирование, предлагающее хорошо структурированные курсы как для начинающих, так и для опытных разработчиков.',
  'main.rs-2':
    'Известная своим высоким качеством образования, RSSchool предоставляет комплексную программу, охватывающую всё — от основ HTML, CSS и JavaScript до продвинутых технологий, таких как React и Node.js. Школа делает акцент на обучении через проекты, позволяя студентам создавать реальные проекты и развивать впечатляющие портфолио.',
  'main.rs-3':
    'RSSchool процветает благодаря активному сообществу волонтёров, включая опытных разработчиков и выпускников, которые наставляют и поддерживают новых учащихся.',

  'teamMember.role': 'Роль',
  'teamMember.contributions': 'Вклад',
  'teamMember.bio': 'Краткая биография',
  'teamMember.techStack': 'Стек технологий: ',

  'sign-in.loader': 'Входим...',
  'sign-in.title': 'Вход',
  'sign-in.email': 'Почта',
  'sign-in.password': 'Пароль',
  'sign-in.submit': 'Войти',
} as const;
